const mainData = {
  mainDataY: [10, 20, 30, 60, 50, 70],
  mainDataX: ['部门A', '部门B', '部门C', '部门D', '部门E', '部门F'],
  mainCount: [10, 49, 50, 70, 50, 70],
  moodData: [['部门A', 10, 20, 30], ['部门B', 10, 30, 20], ['部门C', 10, 24, 20], ['部门D', 10, 20, 15], ['部门E', 10, 20, 10], ['部门F', 10, 30, 10]],
};

const teamData = {
  mainDataY: [10, 30, 40, 30, 30, 70],
  mainDataX: ['负责人A', '负责人B', '负责人C', '负责人D', '负责人E', '负责人F'],
  mainDatapreY: [10, 30, 40, 30, 30, 70],
  mainDatapreX: ['负责人A', '负责人B', '负责人C', '负责人D', '负责人E', '负责人F'],
  weekY: [3, 5, 4, 3, 3, 7],
  weekX: ['2020-08-31至2020-09-01', '2020-08-31至2020-09-01', '2020-08-31至2020-09-01', '2020-08-31至2020-09-01', '2020-08-31至2020-09-01', '2020-08-31至2020-09-01'],
};

const userData = {
  mainDataY: [['2020-10-01', 10], ['2020-10-07', 20], ['2020-10-14', 20], ['2020-10-18', 20], ['2020-10-19', 20], ['2020-10-30', 20]],
  mainDataX: ['2020-10-01', '2020-10-07', '2020-10-14', '2020-10-18', '2020-10-19', '2020-10-30'],
};

module.exports = {
  mainData,
  teamData,
  userData,
};